apache/nuttx/arch/arm/src/kinetis/kinetis_i2c.c
/* I2C device structures */

#ifdef CONFIG_KINETIS_I2C0
static const struct kinetis_i2c_config_s kinetis_i2c0_config =
{
  .base       = KINETIS_I2C0_BASE,
  .clk_reg    = KINETIS_SIM_SCGC4,
  .clk_bit    = SIM_SCGC4_I2C0,
  .scl_pin    = PIN_I2C0_SCL,
  .sda_pin    = PIN_I2C0_SDA,
  .irqid      = KINETIS_IRQ_I2C0,
};

static struct kinetis_i2cdev_s g_i2c0_dev =
{
  .dev.ops    = &kinetis_i2c_ops,
  .config     = &kinetis_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
  .wait       = SEM_INITIALIZER(0),
  .state      = STATE_OK,
  .msgs       = NULL,
};
#endif

#ifdef CONFIG_KINETIS_I2C1
static const struct kinetis_i2c_config_s kinetis_i2c1_config =
{
  .base       = KINETIS_I2C1_BASE,
  .clk_reg    = KINETIS_SIM_SCGC4,
  .clk_bit    = SIM_SCGC4_I2C1,
  .scl_pin    = PIN_I2C1_SCL,
  .sda_pin    = PIN_I2C1_SDA,
  .irqid      = KINETIS_IRQ_I2C1,
};

static struct kinetis_i2cdev_s g_i2c1_dev =
{
  .dev.ops    = &kinetis_i2c_ops,
  .config     = &kinetis_i2c1_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
  .wait       = SEM_INITIALIZER(0),
  .state      = STATE_OK,
  .msgs       = NULL,
};
#endif

#ifdef CONFIG_KINETIS_I2C2
static const struct kinetis_i2c_config_s kinetis_i2c2_config =
{
  .base       = KINETIS_I2C2_BASE,
  .clk_reg    = KINETIS_SIM_SCGC1,
  .clk_bit    = SIM_SCGC1_I2C2,
  .scl_pin    = PIN_I2C2_SCL,
  .sda_pin    = PIN_I2C2_SDA,
  .irqid      = KINETIS_IRQ_I2C2,
};

static struct kinetis_i2cdev_s g_i2c2_dev =
{
  .dev.ops    = &kinetis_i2c_ops,
  .config     = &kinetis_i2c2_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
  .wait       = SEM_INITIALIZER(0),
  .state      = STATE_OK,
  .msgs       = NULL,
};
#endif

#ifdef CONFIG_KINETIS_I2C3
static const struct kinetis_i2c_config_s kinetis_i2c3_config =
{
  .base       = KINETIS_I2C3_BASE,
  .clk_reg    = KINETIS_SIM_SCGC1,
  .clk_bit    = SIM_SCGC1_I2C3,
  .scl_pin    = PIN_I2C3_SCL,
  .sda_pin    = PIN_I2C3_SDA,
  .irqid      = KINETIS_IRQ_I2C3,
};

static struct kinetis_i2cdev_s g_i2c3_dev =
{
  .dev.ops    = &kinetis_i2c_ops,
  .config     = &kinetis_i2c3_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
  .wait       = SEM_INITIALIZER(0),
  .state      = STATE_OK,
  .msgs       = NULL,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kinetis_i2c_getreg
 *
 * Description:
 *   Get a 16-bit register value by offset
 *
 ****************************************************************************/

static uint8_t kinetis_i2c_getreg(struct kinetis_i2cdev_s *priv,
                                  uint8_t offset)
{
  return getreg8(priv->config->base + offset);
}

/****************************************************************************
 * Name: kinetis_i2c_putreg
 *
 * Description:
 *  Put a 16-bit register value by offset
 *
 ****************************************************************************/

static void kinetis_i2c_putreg(struct kinetis_i2cdev_s *priv, uint8_t value,
                               uint8_t offset)
{
  putreg8(value, priv->config->base + offset);
}

/****************************************************************************
 * Name: kinetis_i2c_wait
 *
 * Description:
 *   Wait on the signaling semaphore.  May be interrupted by a signal.
 *
 ****************************************************************************/

static inline void kinetis_i2c_wait(struct kinetis_i2cdev_s *priv)
{
  nxsem_wait(&priv->wait);
}

/****************************************************************************
 * Name: kinetis_i2c_endwait
 *
 * Description:
 *   Release the signaling semaphore
 *
 ****************************************************************************/

static inline void kinetis_i2c_endwait(struct kinetis_i2cdev_s *priv)
{
  nxsem_post(&priv->wait);
}

/****************************************************************************
 * Name: kinetis_i2c_init
 *
 * Description:
 *   Setup the I2C hardware, ready for operation with defaults
 *
 ****************************************************************************/

static int kinetis_i2c_init(struct kinetis_i2cdev_s *priv)
{
  uint32_t regval;

  /* Enable the clock to peripheral */

  modifyreg32(priv->config->clk_reg, 0, priv->config->clk_bit);

  /* Disable while configuring */

  kinetis_i2c_putreg(priv, 0, KINETIS_I2C_C1_OFFSET);

  /* Configure pins */

  if (kinetis_pinconfig(priv->config->scl_pin) < 0)
    {
      return ERROR;
    }

  if (kinetis_pinconfig(priv->config->sda_pin) < 0)
    {
      kinetis_pinconfig(MKI2C_INPUT(priv->config->scl_pin));
      return ERROR;
    }

  /* High-drive select */

  regval = kinetis_i2c_getreg(priv, KINETIS_I2C_C2_OFFSET);
  regval |= I2C_C2_HDRS;
  kinetis_i2c_putreg(priv, regval, KINETIS_I2C_C2_OFFSET);

  /* Attach Interrupt Handler */

  irq_attach(priv->config->irqid, kinetis_i2c_interrupt, priv);

  /* Enable Interrupt Handler */

  up_enable_irq(priv->config->irqid);

  /* Force a frequency update */

  priv->frequency = 0;

  /* Set the default I2C frequency */

  kinetis_i2c_setfrequency(priv, I2C_DEFAULT_FREQUENCY);

  /* Enable I2C */

  kinetis_i2c_putreg(priv, I2C_C1_IICEN, KINETIS_I2C_C1_OFFSET);
  return OK;
}

/****************************************************************************
 * Name: kinetis_i2c_deinit
 *
 * Description:
 *   Shutdown the I2C hardware
 *
 ****************************************************************************/

static int kinetis_i2c_deinit(struct kinetis_i2cdev_s *priv)
{
  /* Disable I2C */

  kinetis_i2c_putreg(priv, 0, KINETIS_I2C_C1_OFFSET);

  /* Unconfigure GPIO pins */

  kinetis_pinconfig(MKI2C_INPUT(priv->config->scl_pin));
  kinetis_pinconfig(MKI2C_INPUT(priv->config->sda_pin));

  /* Disable and detach interrupts */

  up_disable_irq(priv->config->irqid);
  irq_detach(priv->config->irqid);

  /* Disable clocking */

  modifyreg32(priv->config->clk_reg, priv->config->clk_bit, 0);
  return OK;
}

/****************************************************************************
 * Name: kinetis_i2c_setfrequency
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/

static void kinetis_i2c_setfrequency(struct kinetis_i2cdev_s *priv,
                                     uint32_t frequency)
{
  i2cinfo("frequency=%lu\n", (unsigned long)frequency);

  if (frequency == priv->frequency)
    {
      return;
    }

#if BOARD_BUS_FREQ == 120000000
  if (frequency < 400000)
    {
      kinetis_i2c_putreg(priv, I2C_F_DIV1152, KINETIS_I2C_F_OFFSET);   /* 104 kHz */
    }
  else if (frequency < 1000000)
    {
      kinetis_i2c_putreg(priv, I2C_F_DIV288, KINETIS_I2C_F_OFFSET);    /* 416 kHz */
    }
  else
    {
      kinetis_i2c_putreg(priv, I2C_F_DIV128, KINETIS_I2C_F_OFFSET);    /* 0.94 MHz */
    }

